{
    "commentInfo": "Every commentXXX key here is not used and serves only one purpose - to describe everything in this file :) You don't need to include these in your custom files.",
    "commentInfo2": "You can use NNDDefaults.json as a starting point without any comments.",
    "commentNaming": "All keys should be prefixed with  to make strings unique, so that Skyrim won't mess with their case",
    "commentOptionality": "All keys are optional and can be skipped if not applicable. This file shows all default values for keys.",
    
    "commentFirst": "This section defines rules for First names.",
    "First": {
        "commentMale": "Rules specific to Male. If omitted mod will fallback to Any if present, otherwise Male NPCs won't get a First name.",
        "Male": {
            "commentChance": "Chance that Male NPC will get any name picked. If First name isn't picked, then Last is guaranteed regardless of Chance configured there.",
            "Chance": 100,
            "commentNames": "List of all availalbe Male names.",
            "Names": [],
            "commentPrefix": "Allows to add randomized prefixes. Note that prefixes only apply if First name was picked.",
            "Prefix": {
                "Chance": 100,
                "Names": []
            },
            "commentSuffix": "Allows to add randomized suffixes. Note that suffixes only apply if First name was picked.",
            "Suffix": {
                "Chance": 100,
                "Names": []
            }
        },
        "commentFemale": "Rules specific to Female. If omitted mod will fallback to Any if present, otherwise Female NPCs won't get a First name.",
        "Female": {
            "Chance": 100,
            "Names": [],
            "Prefix": {
                "Chance": 100,
                "Names": []
            },
            "Suffix": {
                "Chance": 100,
                "Names": []
            }
        },
        "commentAny": "Generic rules. If omitted mod will only use gender-specific rules if they present, otherwise NPC won't get a First name",
        "Any": {
            "Chance": 100,
            "Names": [],
            "Prefix": {
                "Chance": 100,
                "Names": []
            },
            "Suffix": {
                "Chance": 100,
                "Names": []
            }
        },
        "commentBehavior": "Behaviors are a list of options to customize how this Name Definition handles missing name parts",
        "Behavior": {
            "commentInherit": "When enabled and First name was not picked, it allows the framework to look for the First name in the next Name Definition",
            "Inherit": false,
            "commentCircumfix": "When enabled, will synchronize picked prefix and suffix",
            "commentCircumfix2": "e.g. when there are 3 prefixes and suffixes, Name Definition will pick one index for both lists.",
            "commentCircumfix3": "Note that number of prefixes and suffixes must match, otherwise length of the shortest one will be used.",
            "Circumfix": false
        }
    },
    
    "commentLast": "This section defines rules for Last names. See First for details on each section.",
    "Last": {
        "Male": {
            "Chance": 100,
            "Names": [],
            "Prefix": {
                "Chance": 100,
                "Names": []
            },
            "Suffix": {
                "Chance": 100,
                "Names": []
            }
        },
        "Female": {
            "Chance": 100,
            "Names": [],
            "Prefix": {
                "Chance": 100,
                "Names": []
            },
            "Suffix": {
                "Chance": 100,
                "Names": []
            }
        },
        "Any": {
            "Chance": 100,
            "Names": [],
            "Prefix": {
                "Chance": 100,
                "Names": []
            },
            "Suffix": {
                "Chance": 100,
                "Names": []
            }
        },
        "Behavior": {
            "Inherit": false,
            "Circumfix": false
        }
    },
    
    "commentConjunctions": "This section defines how First and Last names get connected. Same gender rules apply as in other sections.",
    "Conjunctions": {
        "Male": [],
        "Female": [],
        "Any": [" "]
    },

    "commentBehavior": "Name Definition itself also has Behavior that controls whole definition",
    "Behavior": {
        "commentChance": "Name Definition can have a chance of being skipped. By default Definition is never skipped.",
        "commentChance2": "This option is ignored if the Name Definition is the last in queue, as othwerise NPC might not get a name at all.",
        "Chance": 100,
        "commentScopes": "Scopes define where this Name Definition can be applied. Possible values are: Name, Title and Obscuring",
        "commentScopes2": "Name Definition can have multiple scopes, which make it an eligible pool of names for each scope.",
        "commentScopes3": "When not specified, it defaults to 'Name' scope. Otherwise you have to explicitly list all scopes",
        "commentName": "Name scope indicates that Name Definition contains names that should be applied as NPC's main name. This is default scope.",
        "commentTitle": "Title scope indicates that Name Definition contains names that should be applied as NPC's Title. This would replace default title",
        "commentObscuring": "Obscuring scope indicates that Name Definition contains names that should be applied as name for unknown NPCs.",
        "Scopes": ["Name"]
    }
}
